let sampleTracks: array<Core.track> = [
  {
    title: "白桦林",
    artist: "朴树",
    link: "http://music.163.com/song/media/outer/url?id=5273188.mp3",
    cover: Some("https://p1.music.126.net/MZ1KYMkmAr-lDkE-ZaMaQg==/109951169026406813.jpg"),
    album: None,
    lyric: Some(
      "[00:00.000] 作词 : 朴树\n[00:01.000] 作曲 : 朴树\n[00:02.000] 制作人 : 张亚东\n[00:17.000]静静的村庄飘着白的雪\n[00:22.850]阴霾的天空下鸽子飞翔\n[00:28.990]白桦树刻着那两个名字\n[00:34.820]他们发誓相爱用尽这一生\n[00:41.020]有一天战火烧到了家乡\n[00:47.050]小伙子拿起枪奔赴边疆\n[00:53.070]心上人你不要为我担心\n[00:59.110]等着我回来在那片白桦林\n[01:05.250]天空依然阴霾依然有鸽子在飞翔\n[01:11.220]谁来证明那些没有墓碑的爱情和生命\n[01:17.110]雪依然在下那村庄依然安详\n[01:23.180]年轻的人们消逝在白桦林\n[01:29.340]噩耗声传来在那个午后\n[01:35.270]心上人战死在远方沙场\n[01:41.360]她默默来到那片白桦林\n[01:47.750]望眼欲穿地每天守在那里\n[02:06.030]她说他只是迷失在远方\n[02:12.950]他一定会来来这片白桦林\n[02:19.280]天空依然阴霾依然有鸽子在飞翔\n[02:25.250]谁来证明那些没有墓碑的爱情和生命\n[02:31.510]雪依然在下那村庄依然安详\n[02:37.230]年轻的人们消逝在白桦林\n[02:43.530]长长的路呀就要到尽头\n[02:49.570]那姑娘已经是白发苍苍\n[02:55.460]她时常听他在枕边呼唤\n[03:01.530]来吧 亲爱的 来这片白桦林\n[03:07.560]在死的时候她喃喃地说\n[03:13.500]我来了 等着我在那片白桦林\n",
    ),
    subLyric: None,
  },
  {
    title: "光辉岁月-Beyond-",
    artist: "音乐心情故事",
    link: "http://music.163.com/song/media/outer/url?id=2616728002.mp3",
    cover: Some("https://p1.music.126.net/Uoi4Rl26pj7vOBGZ8ewVpA==/109951169867185547.jpg"),
    album: None,
    lyric: None,
    subLyric: None,
  },
  {
    title: "那些花儿(吉他版)",
    artist: "朴树",
    link: "http://music.163.com/song/media/outer/url?id=139392.mp3",
    cover: Some("https://p1.music.126.net/w4ve3fd97ql6f34biizbGg==/109951171437356440.jpg"),
    album: None,
    lyric: Some(
      "[00:00.000] 编曲 : 张亚东\n[00:01.000] 作词 : 朴树/付翀\n[00:02.000] 作曲 : 朴树\n[00:16.798]那片笑声让我想起我的那些花儿\n[00:25.399]在我生命每个角落静静为我开着\n[00:32.999]我曾以为我会永远守在她身旁\n[00:41.199]今天我们已经离去在人海茫茫\n[00:49.790]她们都老了吧她们在哪里呀\n[00:59.300]我们就这样各自奔天涯\n[01:06.019]啦啦啦啦啦啦啦啦啦啦啦 想她\n[01:14.269]啦啦啦啦啦啦啦啦\n[01:19.569]她还在开吗\n[01:24.190]啦啦啦啦啦啦啦啦啦啦啦 去呀\n[01:32.390]她们已经被风吹走散落在天涯\n[01:56.199]有些故事还没讲完那就算了吧\n[02:05.300]那些心情在岁月中已经难辨真假\n[02:12.667]如今这里荒草丛生没有了鲜花\n[02:20.926]好在曾经拥有你们的春秋和冬夏\n[02:29.688]她们都老了吧她们在哪里呀\n[02:38.880]我们就这样各自奔天涯\n[02:45.887]啦啦啦啦啦啦啦啦啦啦啦 想她\n[02:54.197]啦啦啦啦啦啦啦啦\n[02:59.289]她还在开吗\n[03:02.378]啦啦啦啦啦啦啦啦啦啦啦 去呀\n[03:10.688]她们已经被风吹走散落在天涯\n[03:47.658]她们已经被风吹走散落在天涯\n[03:51.527]她们都老了吧她们在哪里呀\n[04:00.688]我们就这样各自奔天涯\n",
    ),
    subLyric: None,
  },
  {
    title: "凤凰传奇-奢香夫人（DJ-JOSH Hard remix）",
    artist: "DJ-JOSH",
    link: "http://music.163.com/song/media/outer/url?id=2614222610.mp3",
    cover: Some("https://p1.music.126.net/FF_-i4gfKY7RhT9bxGBhVw==/109951169843622215.jpg"),
    album: None,
    lyric: None,
    subLyric: None,
  },
  {
    title: "下定决心忘记你",
    artist: "杜飞",
    link: "http://music.163.com/song/media/outer/url?id=440241262.mp3",
    cover: Some("https://p1.music.126.net/d8JkigM2azR2qopZrCE-1w==/109951162807660320.jpg"),
    album: None,
    lyric: Some(
      "[00:00.000] 作词 : 正云\n[00:00.118] 作曲 : 曼萱\n[00:00.236]杜飞-下定决心忘记你\n[00:01.795]词：正云\n[00:02.447]曲：曼萱\n[00:27.565]走在彷徨的路上\n[00:30.785]我的心情暗自伤\n[00:34.150]多少快乐的往事\n[00:37.443]都随风儿去远方\n[00:40.979]说好不悲伤\n[00:43.946]为何泪红了眼眶\n[00:47.219]只因对你情太深\n[00:53.853]曾经相爱到放弃\n[00:56.926]如果继续也没有意义\n[01:00.242]曾经迷失了我自己\n[01:03.460]我会离开你远去\n[01:06.886]走到海角天边\n[01:10.150]刻骨铭心这份真情\n[01:13.569]含泪默默哭泣\n[01:16.789]下定决心忘记你\n[01:53.420]走在彷徨的路上\n[01:56.159]我的心情暗自伤\n[01:59.481]多少快乐的往事\n[02:02.750]都随风儿去远方\n[02:06.459]说好不悲伤\n[02:09.223]为何泪红了眼眶\n[02:12.644]只因对你情太深\n[02:19.279]曾经相爱到放弃\n[02:22.447]如果继续也没有意义\n[02:25.665]曾经迷失了我自己\n[02:28.886]我会离开你远去\n[02:32.353]走到海角天边\n[02:35.516]刻骨铭心这份真情\n[02:39.340]含泪默默哭泣\n[02:42.154]下定决心忘记你\n[02:52.217]曾经相爱到放弃\n[02:55.285]如果继续也没有意义\n[02:58.650]曾经迷失了我自己\n[03:01.867]我会离开你远去\n[03:05.185]走到海角天边\n[03:08.456]刻骨铭心这份真情\n[03:11.874]含泪默默哭泣\n[03:15.140]下定决心忘记你\n",
    ),
    subLyric: None,
  },
  {
    title: "苹果香（童声版）",
    artist: "王静瑶",
    link: "http://music.163.com/song/media/outer/url?id=2622538819.mp3",
    cover: Some("https://p1.music.126.net/iYWYd_Iqjd9VHsRuAyghDQ==/109951169918959655.jpg"),
    album: None,
    lyric: Some(
      "[00:00.00] 作词 : 狼戈\n[00:01.00] 作曲 : 狼戈\n[00:17.49]红嘴雁啊飞回芦苇随风摆\n[00:24.60]河对面的莎吾烈泰 今天在不在\n[00:31.65]那年我饮马来到了 你的白毡房\n[00:38.28]我曾看到你弹着冬布拉 听过你把歌唱\n[00:47.57]单纯的相逢 平凡的晚上\n[00:54.60]我就在那个时候啊 傻傻的等到了天亮\n[01:01.64]月亮作证 你毡帽上的羽毛\n[01:08.67]亲吻着晚风飘啊飘 啊飘到了我的心上\n[01:24.57]六星街里还传来 巴扬琴声吗\n[01:31.68]阿力克桑德拉的面包房 列巴出炉了吗\n[01:38.73]南苑卤香是舌尖上的故事啊\n[01:45.32]你让浪迹天涯的孩子啊 梦中回家吧\n[01:54.62]儿时的万花筒里 有野鸽在飞翔\n[02:01.68]这让我想起二哥 和他心爱的弹弓叉\n[02:08.75]湖蓝色的院墙 我生命里的院落\n[02:15.30]我的妈妈在那里给我的爱 叫我永生不忘啊\n[02:54.53]心中有个地方 刻进了你的名字\n[03:01.59]草原 河谷 月季花香 都是我的歌\n[03:08.78]儿时离开你 正逢花开时\n[03:15.33]如今往事 远了 模糊了 我却忘不了苹果香\n[03:24.18]如今往事 远了 模糊了 我却忘不了苹果香\n",
    ),
    subLyric: None,
  },
  {
    title: "忘情水",
    artist: "刘德华",
    link: "http://music.163.com/song/media/outer/url?id=1438246130.mp3",
    cover: Some("https://p1.music.126.net/rF1VJWsm3dWPugv042j8Bg==/109951164877954978.jpg"),
    album: None,
    lyric: Some(
      "[00:00.000] 作词 : 李安修\n[00:01.000] 作曲 : 陳耀川\n[00:26.267]曾经年少爱追梦\n[00:29.819]一心只想往前飞\n[00:33.320]行遍千山和万水\n[00:37.264]一路走来不能回\n[00:40.791]蓦然回首情已远\n[00:44.317]身不由已在天边\n[00:47.922]才明白爱恨情仇\n[00:51.710]最伤最痛是后悔\n[00:55.471]如果你不曾心碎\n[00:58.789]你不会懂得我伤悲\n[01:02.838]当我眼中有泪，别问我是为谁\n[01:06.417]就让我忘了这一切\n[01:09.238]啊，给我一杯忘情水\n[01:13.653]换我一夜不流泪\n[01:17.310]所有真心真意\n[01:19.034]任它雨打风吹\n[01:20.915]付出的爱收不回\n[01:24.729]给我一杯忘情水\n[01:28.307]换我一生不伤悲\n[01:32.043]就算我会喝醉\n[01:33.767]就算我会心碎\n[01:35.700]不会看见我流泪\n[02:09.293]曾经年少...\n[02:57.019]换我一夜不流泪\n[03:00.023]所有真心真意\n[03:01.669]任它雨打风吹\n[03:03.628]付出的爱收不回\n[03:07.338]给我一杯忘情水\n[03:10.864]换我一生不伤悲\n[03:14.626]就算我会喝醉\n[03:16.271]就算我会心碎\n[03:18.204]不会看见我流泪\n[03:26.773]啊，给我一杯忘情水\n[03:31.109]换我一夜不流泪\n[03:34.766]所有真心真意\n[03:36.412]任它雨打风吹\n[03:38.397]付出的爱收不回\n[03:42.054]给我一杯忘情水\n[03:45.659]换我一生不伤悲\n[03:49.525]就算我会喝醉\n[03:51.145]就算我会心碎\n[03:53.104]不会看见我流泪\n[03:56.996]就算我会喝醉\n[03:58.459]就算我会心碎\n[04:00.523]不会看见我流泪\n",
    ),
    subLyric: None,
  },
  {
    title: "花开的时候你就来看我",
    artist: "田阿姨",
    link: "http://music.163.com/song/media/outer/url?id=2016079870.mp3",
    cover: Some("https://p1.music.126.net/dnCfJeHnievinrqgVpgewQ==/109951167210847438.jpg"),
    album: None,
    lyric: Some(
      "[00:19.086]翻几座高山趟几条长河\n[00:23.608]才能找到我梦中的辽阔\n[00:28.379]风那么一吹雨那么一落\n[00:32.898]漫山遍野就开满七色的烟火\n[00:37.412]喝几碗烈酒唱几首情歌\n[00:41.938]温暖着你我心中的蹉跎\n[00:46.713]天那么的蓝地那么的宽\n[00:51.228]策马扬鞭别错过远方的传说\n[00:58.137]花开的时候你就来看我\n[01:02.646]等你来摘最美的那一朵\n[01:07.167]月起的时候点燃了篝火\n[01:11.677]你会看见最炽热的眼波\n[01:16.192]花开的时候你就来看我\n[01:20.708]别等花落只留下了寂寞\n[01:25.234]不要辜负这如火的春色\n[01:30.006]我的温柔比那花儿还要多\n[01:52.804]喝几碗烈酒唱几首情歌\n[01:57.578]温暖着你我心中的蹉跎\n[02:01.824]天那么的蓝地那么的宽\n[02:06.349]策马扬鞭别错过远方的传说\n[02:13.512]花开的时候你就来看我\n[02:17.764]等你来摘最美的那一朵\n[02:22.547]月起的时候点燃了篝火\n[02:27.059]你会看见最炽热的眼波\n[02:31.578]花开的时候你就来看我\n[02:36.099]别等花落只留下了寂寞\n[02:40.871]不要辜负这如火的春色\n[02:45.327]我的温柔比那花儿还要多\n[02:50.113]花开的时候你就来看我\n[02:54.624]等你来摘最美的那一朵\n[02:59.145]月起的时候点燃了篝火\n[03:03.396]你会看见最炽热的眼波\n[03:08.171]花开的时候你就来看我\n[03:12.687]别等花落只留下了寂寞\n[03:17.207]不要辜负这如火的春色\n[03:21.983]我的温柔比那花儿还要多\n[03:26.503]我的温柔比那花儿还要多\n",
    ),
    subLyric: None,
  },
]

let toAudioItem = (t: Core.track): RPlayer.audioItem => {
  name: t.title,
  artist: t.artist,
  url: t.link,
  cover: t.cover,
  lrc: t.lyric,
}

switch Core.Dom.querySelector(Core.Dom.document, "#app") {
| Value(container) => {
    let instance = RPlayer.make({
      container,
      fixed: Some(true),
      autoplay: Some(true),
      order: Some(Random),
      color: Some("#F7DCFF"),
      theme: Some(Auto),
      audio: sampleTracks->Array.map(toAudioItem),
      titleChange: Some(true),
      showList: Some(false),
      debug: Some(false),
    })
    ignore(instance)
  }
| Null | Undefined => Console.error("Main: #app container not found")
}
